Pandas is a high-performance module that provides a comprehensive set of structure for working with data. 

# 17.1 Data Structures

In [2]:
import numpy as np
from pandas import Series

a = np.array([0.1,1.2,2.3,3.4,4.5])
a

array([ 0.1,  1.2,  2.3,  3.4,  4.5])

In [3]:
a

array([ 0.1,  1.2,  2.3,  3.4,  4.5])

In [4]:
s = Series([0.1,1.2,2.3,3.4,4.5])
s

0    0.1
1    1.2
2    2.3
3    3.4
4    4.5
dtype: float64

In [5]:
s = Series(a,index = ['a','b','c','d','e'])

In [6]:
s

a    0.1
b    1.2
c    2.3
d    3.4
e    4.5
dtype: float64

In [7]:
s['a']

0.10000000000000001

In [8]:
s[0] # numeric selection

0.10000000000000001

In [9]:
s['a':'c'] # Index look up

a    0.1
b    1.2
c    2.3
dtype: float64

In [10]:
s[['a','c']]

a    0.1
c    2.3
dtype: float64

In [11]:
s1 = Series ([1.0,2,3],index = ['a']*3)
s2 = Series ([4.0,5],index = ['a']*2)
s1
s2

a    4.0
a    5.0
dtype: float64

In [12]:
s1

a    1.0
a    2.0
a    3.0
dtype: float64

In [13]:
s1+s2

a    5.0
a    6.0
a    6.0
a    7.0
a    7.0
a    8.0
dtype: float64

In [14]:
#fillna
s1 = Series(np.arange(1.0,4.0),index = ['a','b','c'])
s2 = Series(np.arange(1.0,4.0),index = ['c','d','e'])
s3 = s1+s2

In [15]:
s3.fillna(-1.0)

a   -1.0
b   -1.0
c    4.0
d   -1.0
e   -1.0
dtype: float64

In [16]:
s3.append(Series([4],index=['f']))

a    NaN
b    NaN
c    4.0
d    NaN
e    NaN
f    4.0
dtype: float64

In [17]:
s3.replace(1,4.0)

a    NaN
b    NaN
c    4.0
d    NaN
e    NaN
dtype: float64

In [18]:
s3

a    NaN
b    NaN
c    4.0
d    NaN
e    NaN
dtype: float64

In [19]:
s3.dropna()

c    4.0
dtype: float64

In [20]:
s1 = Series(np.arange(1.0,4.0),index = ['a','b','c'])
s1

a    1.0
b    2.0
c    3.0
dtype: float64

In [21]:
s2 = Series(-1.0*np.arange(1.0,4.0),index = ['c','d','e'])

In [22]:
s2

c   -1.0
d   -2.0
e   -3.0
dtype: float64

In [23]:
s1.update(s2)

In [24]:
s1

a    1.0
b    2.0
c   -1.0
dtype: float64

In [25]:
#17.1.2 DataFrame
from pandas import DataFrame
a = np.array([[1.0,2],[3,4]])
df = DataFrame(a)
df

     0    1
0  1.0  2.0
1  3.0  4.0

In [26]:
df = DataFrame(np.array([[1,2],[3,4]]),columns = ['a','b'])
df

   a  b
0  1  2
1  3  4

In [27]:
df = DataFrame(np.array([[1,2],[3,4]]))

In [28]:
df.columns = ['dogs','cats']

In [29]:
df

   dogs  cats
0     1     2
1     3     4

In [30]:
df.index = ['A','B']

In [31]:
df

   dogs  cats
A     1     2
B     3     4

In [32]:
# final way to create dataframe. from multiple series
s1 = Series(np.arange(0.0,5))
s2 = Series(np.arange(1.0,6))
s3 = DataFrame({'one':s1,'two':s2})

In [33]:
s3

   one  two
0  0.0  1.0
1  1.0  2.0
2  2.0  3.0
3  3.0  4.0
4  4.0  5.0

In [34]:
s3.one

0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
Name: one, dtype: float64

In [35]:
s3[1:3]

   one  two
1  1.0  2.0
2  2.0  3.0

In [36]:
s3.iloc[1:3]

   one  two
1  1.0  2.0
2  2.0  3.0

In [37]:
s3b = s3['one']>3

In [38]:
s3b

0    False
1    False
2    False
3    False
4     True
Name: one, dtype: bool

In [39]:
s3[s3b]

   one  two
4  4.0  5.0

In [40]:
s3.ix[s3b,'two']

4    5.0
Name: two, dtype: float64

In [41]:
s3.ix[1,'two']

2.0

In [42]:
s3.ix[1:2,:]

   one  two
1  1.0  2.0
2  2.0  3.0

In [43]:
s4 = s3['one']

In [44]:
s3['three'] = s4

In [45]:
s3.insert(1,'four',s4)

In [46]:
s3

   one  four  two  three
0  0.0   0.0  1.0    0.0
1  1.0   1.0  2.0    1.0
2  2.0   2.0  3.0    2.0
3  3.0   3.0  4.0    3.0
4  4.0   4.0  5.0    4.0

In [47]:
# deleting columns. 
# Columns are deleted using del keyword. 
# del, pop, drop

del s3['four']

In [48]:
s3

   one  two  three
0  0.0  1.0    0.0
1  1.0  2.0    1.0
2  2.0  3.0    2.0
3  3.0  4.0    3.0
4  4.0  5.0    4.0

In [49]:
s5 = s3.drop(['three'],axis=1)

In [50]:
s5

   one  two
0  0.0  1.0
1  1.0  2.0
2  2.0  3.0
3  3.0  4.0
4  4.0  5.0

In [51]:
s3

   one  two  three
0  0.0  1.0    0.0
1  1.0  2.0    1.0
2  2.0  3.0    2.0
3  3.0  4.0    3.0
4  4.0  5.0    4.0

In [52]:
s3[0,'one']=10

s3.columns

In [53]:
s3.columns

Index(['one', 'two', 'three', (0, 'one')], dtype='object')

In [54]:
s3=s3.drop(s3.columns[-1],axis=1)

In [55]:
s3

   one  two  three
0  0.0  1.0    0.0
1  1.0  2.0    1.0
2  2.0  3.0    2.0
3  3.0  4.0    3.0
4  4.0  5.0    4.0

In [56]:
s3.sort(columns='one')

C:\Program Files\Anaconda3\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: sort(columns=....) is deprecated, use sort_values(by=.....)
  if __name__ == '__main__':

   one  two  three
0  0.0  1.0    0.0
1  1.0  2.0    1.0
2  2.0  3.0    2.0
3  3.0  4.0    3.0
4  4.0  5.0    4.0

In [57]:
s3.sort_values(['one'],ascending=False)

   one  two  three
4  4.0  5.0    4.0
3  3.0  4.0    3.0
2  2.0  3.0    2.0
1  1.0  2.0    1.0
0  0.0  1.0    0.0

In [58]:
#pivot very useful
prices = [101.0,102,103]
tickers = ['GOOG','AAPL']
import itertools
data = [v for v in itertools.product(tickers,prices)]
import pandas as pd
dates = pd.date_range('2013-01-03',periods = 3)
data

[('GOOG', 101.0),
 ('GOOG', 102),
 ('GOOG', 103),
 ('AAPL', 101.0),
 ('AAPL', 102),
 ('AAPL', 103)]

In [59]:
df = DataFrame(data,columns=['ticker','price'])
df['dates'] = dates.append(dates)
df

  ticker  price      dates
0   GOOG  101.0 2013-01-03
1   GOOG  102.0 2013-01-04
2   GOOG  103.0 2013-01-05
3   AAPL  101.0 2013-01-03
4   AAPL  102.0 2013-01-04
5   AAPL  103.0 2013-01-05

In [60]:
df.pivot(index='dates',columns='ticker',values='price')

ticker       AAPL   GOOG
dates
2013-01-03  101.0  101.0
2013-01-04  102.0  102.0
2013-01-05  103.0  103.0

In [61]:
df

  ticker  price      dates
0   GOOG  101.0 2013-01-03
1   GOOG  102.0 2013-01-04
2   GOOG  103.0 2013-01-05
3   AAPL  101.0 2013-01-03
4   AAPL  102.0 2013-01-04
5   AAPL  103.0 2013-01-05

In [62]:
df1=DataFrame([1,2,3],index=['a','b','c'],columns=['one'])
df2=DataFrame([4,5,6],index=['c','d','e'],columns=['two'])
pd.concat((df1,df2),axis=1)
#concat concatenates two or more DataFrames using an outer join by defaul. 
# outer join: joining data frames using the union of the indices of input data frame
# inner join: intersection of indcies.

   one  two
a  1.0  NaN
b  2.0  NaN
c  3.0  4.0
d  NaN  5.0
e  NaN  6.0

In [63]:
# reindex, reindex_like, reindex_axis
original = DataFrame([[1,1],[2,2],[3.0,3]],index=['a','b','c'], columns=['one','two'])

In [64]:
original

   one  two
a  1.0    1
b  2.0    2
c  3.0    3

In [65]:
original.reindex(index=['b','c','d'])

   one  two
b  2.0  2.0
c  3.0  3.0
d  NaN  NaN

In [66]:
different = DataFrame([[1,1],[2,2],[3,3]],index=['c','d','e'],columns=['one','two'])

In [67]:
original.reindex_like(different)

   one  two
c  3.0  3.0
d  NaN  NaN
e  NaN  NaN

In [68]:
original.reindex_axis(['three','one'],axis=1)

   three  one
a    NaN  1.0
b    NaN  2.0
c    NaN  3.0

In [74]:
# merge and join
# merge defaults to using column contents
# join defaults to using index labels. 

left = DataFrame([[1,2],[3,4],[5,6]],columns=['one','two'])
right = DataFrame([[1,2],[3,4],[7,8]],columns=['one','three'])
left.merge(right,on='one')

   one  two  three
0    1    2      2
1    3    4      4

In [75]:
left.merge(right,on='one',how='left')

   one  two  three
0    1    2    2.0
1    3    4    4.0
2    5    6    NaN

In [76]:
left.merge(right,on='one',how='right')

   one  two  three
0    1  2.0      2
1    3  4.0      4
2    7  NaN      8

In [77]:
left.merge(right,on='one',how='outer')

   one  two  three
0    1  2.0    2.0
1    3  4.0    4.0
2    5  6.0    NaN
3    7  NaN    8.0

In [78]:
# Update
left = DataFrame([[1,2],[3,4],[5,6]],columns=['one','two'])
left

   one  two
0    1    2
1    3    4
2    5    6

In [79]:
right = DataFrame([[np.nan,12],[13,np.nan],[np.nan,8]],columns=['one','two'],index=[1,2,3])
right

    one   two
1   NaN  12.0
2  13.0   NaN
3   NaN   8.0

In [80]:
left.update(right)

In [81]:
left

    one   two
0   1.0   2.0
1   3.0  12.0
2  13.0   6.0

In [84]:
# groupby
#dataframe.groupby(by=' ')
# But groupby object byitself doesn't do anything. we need to apply other functions. 

# apply
left.apply(np.mean)

one    5.666667
two    6.666667
dtype: float64

In [85]:
left.apply(np.mean,axis=1)

0    1.5
1    7.5
2    9.5
dtype: float64

In [86]:
left.applymap(np.mean)

    one   two
0   1.0   2.0
1   3.0  12.0
2  13.0   6.0

In [87]:
left.applymap(np.sqrt)

        one       two
0  1.000000  1.414214
1  1.732051  3.464102
2  3.605551  2.449490

# 17.2 Statistical Function

In [89]:
left.one.value_counts()

13.0    1
3.0     1
1.0     1
Name: one, dtype: int64

# 17.3 Time-series Data

In [4]:
from pandas_datareader import data, wb
import datetime
start = datetime.datetime(2010,1,1)
end = datetime.datetime(2016,12,31)
gdp = data.DataReader("GDP","fred",start, end)

In [97]:
gdp.head()

                GDP
DATE
2010-01-01  14681.1
2010-04-01  14888.6
2010-07-01  15057.7
2010-10-01  15230.2
2011-01-01  15238.4

In [103]:
type(gdp)

pandas.core.frame.DataFrame

In [105]:
gdp['2011']

                GDP
DATE
2011-01-01  15238.4
2011-04-01  15460.9
2011-07-01  15587.1
2011-10-01  15785.3

In [106]:
gdp['2010':'2012']

                GDP
DATE
2010-01-01  14681.1
2010-04-01  14888.6
2010-07-01  15057.7
2010-10-01  15230.2
2011-01-01  15238.4
2011-04-01  15460.9
2011-07-01  15587.1
2011-10-01  15785.3
2012-01-01  15973.9
2012-04-01  16121.9
2012-07-01  16227.9
2012-10-01  16297.3

In [107]:
gdp['2010-03-03':'2012-09-09']

                GDP
DATE
2010-04-01  14888.6
2010-07-01  15057.7
2010-10-01  15230.2
2011-01-01  15238.4
2011-04-01  15460.9
2011-07-01  15587.1
2011-10-01  15785.3
2012-01-01  15973.9
2012-04-01  16121.9
2012-07-01  16227.9

In [108]:
#date_range

from pandas import date_range
date_range('2016-01-01','2016-01-06')

DatetimeIndex(['2016-01-01', '2016-01-02', '2016-01-03', '2016-01-04',
               '2016-01-05', '2016-01-06'],
              dtype='datetime64[ns]', freq='D')

In [110]:

date_range('2016-01-01',periods=6)

DatetimeIndex(['2016-01-01', '2016-01-02', '2016-01-03', '2016-01-04',
               '2016-01-05', '2016-01-06'],
              dtype='datetime64[ns]', freq='D')

In [111]:
#freq specifies the frequency
date_range('2016-01-01',periods=4,freq='Q').values

array(['2016-03-31T00:00:00.000000000', '2016-06-30T00:00:00.000000000',
       '2016-09-30T00:00:00.000000000', '2016-12-31T00:00:00.000000000'], dtype='datetime64[ns]')

In [112]:
# combine multiple frequency also works. 
date_range('2016-01-01',periods = 4,freq='7D4H').values

array(['2016-01-01T00:00:00.000000000', '2016-01-08T04:00:00.000000000',
       '2016-01-15T08:00:00.000000000', '2016-01-22T12:00:00.000000000'], dtype='datetime64[ns]')

In [115]:
gdp.resample('A').apply(np.mean).tail()

                  GDP
DATE
2012-12-31  16155.250
2013-12-31  16691.500
2014-12-31  17393.100
2015-12-31  18036.650
2016-12-31  18565.625

In [116]:
gdp.resample('A').apply(np.max)

                GDP
DATE
2010-12-31  15230.2
2011-12-31  15785.3
2012-12-31  16297.3
2013-12-31  16999.9
2014-12-31  17692.2
2015-12-31  18222.8
2016-12-31  18855.5

In [117]:
gdp.pct_change()

                 GDP
DATE
2010-01-01       NaN
2010-04-01  0.014134
2010-07-01  0.011358
2010-10-01  0.011456
2011-01-01  0.000538
2011-04-01  0.014601
2011-07-01  0.008163
2011-10-01  0.012716
2012-01-01  0.011948
2012-04-01  0.009265
2012-07-01  0.006575
2012-10-01  0.004277
2013-01-01  0.010928
2013-04-01  0.004006
2013-07-01  0.012568
2013-10-01  0.014962
2014-01-01  0.001488
2014-04-01  0.015295
2014-07-01  0.016418
2014-10-01  0.006989
2015-01-01  0.005166
2015-04-01  0.012073
2015-07-01  0.007979
2015-10-01  0.004459
2016-01-01  0.003227
2016-04-01  0.009217
2016-07-01  0.012206
2016-10-01  0.009649

In [118]:
gdp.pct_change(periods=4)

                 GDP
DATE
2010-01-01       NaN
2010-04-01       NaN
2010-07-01       NaN
2010-10-01       NaN
2011-01-01  0.037960
2011-04-01  0.038439
2011-07-01  0.035158
2011-10-01  0.036447
2012-01-01  0.048266
2012-04-01  0.042753
2012-07-01  0.041111
2012-10-01  0.032435
2013-01-01  0.031395
2013-04-01  0.026021
2013-07-01  0.032130
2013-10-01  0.043111
2014-01-01  0.033371
2014-04-01  0.044990
2014-07-01  0.048963
2014-10-01  0.040724
2015-01-01  0.044546
2015-04-01  0.041231
2015-07-01  0.032585
2015-10-01  0.029991
2016-01-01  0.028003
2016-04-01  0.025102
2016-07-01  0.029402
2016-10-01  0.034720

# 17.5 Graphics

In [2]:
# plot
# hist
# boxplot
# scatter_plot
# scatter_matrix
# lag_plot

from __future__ import print_function,division
from pandas import read_csv
from pandas.tools.plotting import scatter_matrix

codes = ['GDPC1','INDPRO','CPILFESL','UNRATE','GS10','GS1','BAA','AAA']
names = ['Real GDP','Industrial Production','Core CPI','Unemployment Rate',\
        '10 Year Yield','1 Year Yield','Baa Yield','Aaa Yield']

# r to disable escape
base_url = r'http://research.stlousifed.org/fred2/data/'

In [23]:
from pandas_datareader import data as dt
data = dt.DataReader(codes[0],"fred",start,end)
for code in codes[1:]:
    print(code)
    new = dt.DataReader(code,"fred",start,end)
    data=data.join(new,how='outer')

INDPRO
CPILFESL
UNRATE
GS10
GS1
BAA
AAA

In [24]:
data

              GDPC1    INDPRO  CPILFESL  UNRATE  GS10   GS1   BAA   AAA
DATE
2010-01-01  14604.8   91.9065   220.633     9.8  3.73  0.35  6.25  5.26
2010-02-01      NaN   92.2135   220.731     9.8  3.69  0.35  6.34  5.35
2010-03-01      NaN   92.8133   220.783     9.9  3.73  0.40  6.27  5.27
2010-04-01  14745.9   93.1984   220.822     9.9  3.85  0.45  6.25  5.29
2010-05-01      NaN   94.6492   220.962     9.6  3.42  0.37  6.05  4.96
2010-06-01      NaN   94.8328   221.194     9.4  3.20  0.32  6.23  4.88
2010-07-01  14845.5   95.2539   221.363     9.4  3.01  0.29  6.01  4.72
2010-08-01      NaN   95.6092   221.509     9.5  2.70  0.26  5.66  4.49
2010-09-01      NaN   95.8794   221.711     9.5  2.65  0.26  5.66  4.53
2010-10-01  14939.0   95.6362   221.830     9.4  2.54  0.23  5.72  4.68
2010-11-01      NaN   95.7002   222.149     9.8  2.76  0.25  5.92  4.87
2010-12-01      NaN   96.4959   222.343     9.3  3.29  0.29  6.10  5.02
2011-01-01  14881.3   96.4283   222.803     9.1  3.39  0.27  6.09  5.04
2011-02-01      NaN   96.0111   223.213     9.0  3.58  0.29  6.15  5.22
2011-03-01      NaN   96.8407   223.454     9.0  3.41  0.26  6.03  5.13
2011-04-01  14989.6   96.4337   223.727     9.1  3.46  0.25  6.02  5.16
2011-05-01      NaN   96.6227   224.175     9.0  3.17  0.19  5.78  4.96
2011-06-01      NaN   96.8573   224.697     9.1  3.00  0.18  5.75  4.99
2011-07-01  15021.1   97.3169   225.218     9.0  3.00  0.19  5.76  4.93
2011-08-01      NaN   97.7956   225.862     9.0  2.30  0.11  5.36  4.37
2011-09-01      NaN   97.7474   226.118     9.0  1.98  0.10  5.27  4.09
2011-10-01  15190.3   98.4096   226.506     8.8  2.15  0.11  5.37  3.98
2011-11-01      NaN   98.2810   226.899     8.6  2.01  0.11  5.14  3.87
2011-12-01      NaN   98.6739   227.405     8.5  1.98  0.12  5.25  3.93
2012-01-01  15291.0   99.3787   227.877     8.3  1.97  0.12  5.23  3.85
2012-02-01      NaN   99.6578   228.034     8.3  1.97  0.16  5.14  3.85
2012-03-01      NaN   98.9579   228.478     8.2  2.17  0.19  5.23  3.99
2012-04-01  15362.4   99.8396   228.905     8.2  2.05  0.18  5.19  3.96
2012-05-01      NaN  100.0042   229.224     8.2  1.80  0.19  5.07  3.80
2012-06-01      NaN  100.0318   229.623     8.2  1.62  0.19  5.02  3.64
...             ...       ...       ...     ...   ...   ...   ...   ...
2014-07-01  16094.5  105.2073   238.197     6.2  2.54  0.11  4.73  4.16
2014-08-01      NaN  105.1989   238.380     6.2  2.42  0.11  4.69  4.08
2014-09-01      NaN  105.5750   238.729     5.9  2.53  0.11  4.80  4.11
2014-10-01  16186.7  105.6441   239.147     5.7  2.30  0.10  4.69  3.92
2014-11-01      NaN  106.6868   239.373     5.8  2.33  0.13  4.79  3.92
2014-12-01      NaN  106.5182   239.553     5.6  2.21  0.21  4.74  3.79
2015-01-01  16269.0  105.9906   239.910     5.7  1.88  0.20  4.45  3.46
2015-02-01      NaN  105.8576   240.236     5.5  1.98  0.22  4.51  3.61
2015-03-01      NaN  105.5150   240.783     5.4  2.04  0.25  4.54  3.64
2015-04-01  16374.2  105.2732   241.366     5.4  1.94  0.23  4.48  3.52
2015-05-01      NaN  105.0259   241.662     5.5  2.20  0.24  4.89  3.98
2015-06-01      NaN  104.8599   242.021     5.3  2.36  0.28  5.13  4.19
2015-07-01  16454.9  105.4755   242.480     5.2  2.32  0.30  5.20  4.15
2015-08-01      NaN  105.5783   242.754     5.1  2.17  0.38  5.19  4.04
2015-09-01      NaN  105.3072   243.249     5.0  2.17  0.37  5.34  4.07
2015-10-01  16490.7  105.1649   243.719     5.0  2.07  0.26  5.34  3.95
2015-11-01      NaN  104.4871   244.221     5.0  2.26  0.48  5.46  4.06
2015-12-01      NaN  104.0452   244.581     5.0  2.24  0.65  5.46  3.97
2016-01-01  16525.0  104.5495   245.232     4.9  2.09  0.54  5.45  4.00
2016-02-01      NaN  104.4140   245.845     4.9  1.78  0.53  5.34  3.96
2016-03-01      NaN  103.4255   246.062     5.0  1.89  0.66  5.13  3.82
2016-04-01  16583.1  103.8385   246.517     5.0  1.81  0.56  4.79  3.62
2016-05-01      NaN  103.6937   247.026     4.7  1.81  0.59  4.68  3.65
2016-06-01      NaN  104.2222   247.389     4.9  1.64  0.55  4.53  3.50
2016-07-01  16727.0  104.5225   247.705     4.9  1.50  0.51  4.22  3.28
2016-08-01      NaN  104.4342   248.351     4.9  1.56  0.57  4.24  3.32
2016-09-01      NaN  104.1471   248.646     4.9  1.63  0.59  4.31  3.41
2016-10-01  16804.1  104.4370   249.011     4.8  1.76  0.66   NaN   NaN
2016-11-01      NaN  104.1869   249.464     4.6  2.14  0.74   NaN   NaN
2016-12-01      NaN  104.8175   250.013     4.7  2.49  0.87   NaN   NaN

[84 rows x 8 columns]

In [26]:
term_premium = data['GS10']-data['GS1']

In [28]:
term_premium.name='Term'

In [29]:
term_premium

DATE
2010-01-01    3.38
2010-02-01    3.34
2010-03-01    3.33
2010-04-01    3.40
2010-05-01    3.05
2010-06-01    2.88
2010-07-01    2.72
2010-08-01    2.44
2010-09-01    2.39
2010-10-01    2.31
2010-11-01    2.51
2010-12-01    3.00
2011-01-01    3.12
2011-02-01    3.29
2011-03-01    3.15
2011-04-01    3.21
2011-05-01    2.98
2011-06-01    2.82
2011-07-01    2.81
2011-08-01    2.19
2011-09-01    1.88
2011-10-01    2.04
2011-11-01    1.90
2011-12-01    1.86
2012-01-01    1.85
2012-02-01    1.81
2012-03-01    1.98
2012-04-01    1.87
2012-05-01    1.61
2012-06-01    1.43
              ...
2014-07-01    2.43
2014-08-01    2.31
2014-09-01    2.42
2014-10-01    2.20
2014-11-01    2.20
2014-12-01    2.00
2015-01-01    1.68
2015-02-01    1.76
2015-03-01    1.79
2015-04-01    1.71
2015-05-01    1.96
2015-06-01    2.08
2015-07-01    2.02
2015-08-01    1.79
2015-09-01    1.80
2015-10-01    1.81
2015-11-01    1.78
2015-12-01    1.59
2016-01-01    1.55
2016-02-01    1.25
2016-03-01    1.23
2016-04-01    1.25
2016-05-01    1.22
2016-06-01    1.09
2016-07-01    0.99
2016-08-01    0.99
2016-09-01    1.04
2016-10-01    1.10
2016-11-01    1.40
2016-12-01    1.62
Name: Term, dtype: float64

In [30]:
data = data.join(term_premium,how='outer')

In [31]:
data.columns

Index(['GDPC1', 'INDPRO', 'CPILFESL', 'UNRATE', 'GS10', 'GS1', 'BAA', 'AAA',
       'Term'],
      dtype='object')

In [33]:
default_premium = data['BAA']-data['AAA']
default_premium.name = 'Default'
data = data.join(default_premium,how = 'outer')
data = data.drop(['AAA','BAA','GS10','GS1'],axis=1)
print(data.tail())

              GDPC1    INDPRO  CPILFESL  UNRATE  Term  Default
DATE
2016-08-01      NaN  104.4342   248.351     4.9  0.99     0.92
2016-09-01      NaN  104.1471   248.646     4.9  1.04     0.90
2016-10-01  16804.1  104.4370   249.011     4.8  1.10      NaN
2016-11-01      NaN  104.1869   249.464     4.6  1.40      NaN
2016-12-01      NaN  104.8175   250.013     4.7  1.62      NaN

In [34]:
quarterly = data.dropna()
print(quarterly.tail())

              GDPC1    INDPRO  CPILFESL  UNRATE  Term  Default
DATE
2015-07-01  16454.9  105.4755   242.480     5.2  2.02     1.05
2015-10-01  16490.7  105.1649   243.719     5.0  1.81     1.39
2016-01-01  16525.0  104.5495   245.232     4.9  1.55     1.45
2016-04-01  16583.1  103.8385   246.517     5.0  1.25     1.17
2016-07-01  16727.0  104.5225   247.705     4.9  0.99     0.94

In [38]:
growth_rates_sel = ['GDPC1','INDPRO','CPILFESL']
growth_rates = quarterly[growth_rates_sel].pct_change()
final = quarterly.drop(growth_rates_sel,axis=1).join(growth_rates)
new_names = {'GDPC1':'GDP_growth','INDPRO':'IP_growth'}
final = final.rename(columns = new_names).dropna()
final

            UNRATE  Term  Default  GDP_growth  IP_growth  CPILFESL
DATE
2010-04-01     9.9  3.40     0.96    0.009661   0.014057  0.000857
2010-07-01     9.4  2.72     1.29    0.006754   0.022055  0.002450
2010-10-01     9.4  2.31     1.04    0.006298   0.004013  0.002110
2011-01-01     9.1  3.12     1.05   -0.003862   0.008282  0.004386
2011-04-01     9.1  3.21     0.86    0.007278   0.000056  0.004147
2011-07-01     9.0  2.81     0.83    0.002101   0.009159  0.006664
2011-10-01     8.8  2.04     1.39    0.011264   0.011228  0.005719
2012-01-01     8.3  1.85     1.38    0.006629   0.009848  0.006053
2012-04-01     8.2  1.87     1.23    0.004669   0.004638  0.004511
2012-07-01     8.2  1.34     1.47    0.001198   0.004744  0.004653
2012-10-01     7.8  1.57     1.11    0.000228  -0.000983  0.004583
2013-01-01     8.0  1.76     0.93    0.006994   0.007452  0.005281
2013-04-01     7.6  1.64     0.86    0.001917   0.006152  0.002553
2013-07-01     7.3  2.46     0.98    0.007712  -0.003329  0.004415
2013-10-01     7.2  2.50     0.78    0.009756   0.011698  0.004391
2014-01-01     6.6  2.74     0.70   -0.002970   0.000326  0.004798
2014-04-01     6.2  2.60     0.66    0.009767   0.017361  0.004500
2014-07-01     6.2  2.43     0.57    0.012182   0.009271  0.004707
2014-10-01     5.7  2.20     0.77    0.005729   0.004152  0.003988
2015-01-01     5.7  1.68     0.99    0.005084   0.003280  0.003191
2015-04-01     5.4  1.71     0.96    0.006466  -0.006769  0.006069
2015-07-01     5.2  2.02     1.05    0.004928   0.001922  0.004615
2015-10-01     5.0  1.81     1.39    0.002176  -0.002945  0.005110
2016-01-01     4.9  1.55     1.45    0.002080  -0.005852  0.006208
2016-04-01     5.0  1.25     1.17    0.003516  -0.006801  0.005240
2016-07-01     4.9  0.99     0.94    0.008678   0.006587  0.004819

In [41]:
ax = final[['GDP_growth','IP_growth','UNRATE']].plot(subplots=True)
fig = ax[0].get_figure()
fig.savefig('FRED_data_line_plot.pdf')

ax = scatter_matrix(final[['GDP_growth','IP_growth','UNRATE']],diagonal='kde')
fig = ax[0,0].get_figure()
fig.savefig('FRED_data_scatter_matrix.pdf')